기능: 레스토랑 리스트 화면 기능 테스트

@배달주소화면
시나리오: 요기요 배달 주소 화면 진입
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동

@홈화면
시나리오: 요기요 홈 화면 진입
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	그러면 요기요 홈 화면 이동


	
@레스토랑화면
시나리오: 요기요 레스토랑 전체 리스트 화면 이동
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 

	
@레스토랑화면 @익스프레스 체크
시나리오: 레스토랑 전체 리스트 화면의 익스프레스 필터 체크 
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 
	먼저 요기요 익스프레스 체크

@레스토랑화면 @음식점 안내 클릭
시나리오: 레스토랑 전체 리스트 화면의 음식전 안내 팝업 확인
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 
	먼저 음식점 안내 클릭 


	@레스토랑화면 @탭 스크롤
시나리오: 레스토랑 전체 리스트 탭 스크롤
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 
	먼저 탭 스크롤
	그러면 기존 선택된 탭 보이지 않는다.


		@레스토랑화면 @탭 변경
시나리오: 레스토랑 전체 리스트 탭 변경
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 
	먼저 임의 탭 변경

		@레스토랑화면 @바텀 네비게이션 변경
시나리오: 레스토랑 전체 리스트 바텀 네비게이션 변경
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 
	먼저 바텀 네비게이션 변경

@레스토랑화면 @필터 클릭
시나리오: 레스토랑 전체 리스트 필터 팝업
	먼저 권한 안내 확인 버튼 클릭
	그리고 시작하기 클릭
	그리고 권한 동의 클릭
	그러면 배달 주소 검색 화면 이동
	만일 주소 '서초동 1498-5' 입력
	그리고 주소가 있다면
	먼저 검색된 주소 클릭
	그리고 요기로 배달 버튼 클릭
	그리고 권한 허용 클릭
	만일 요기요 홈 화면 이동
	그리고 음식점 카테고리 전체 클릭
	그러면 음식점 카테고리 화면 이동 
	먼저 음식점 필터 클릭
	그러면 음식점 필터 노출

시나리오: 음식점 필터 화면에서 뒤로가기
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 뒤로가기 버튼 클릭
	그러면 음식점 카테고리 화면 이동

시나리오: 음식점 필터 화면에서 익스프레스 적용하기
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 익스프레스 체크 박스 체크
	그리고 적용하기 버튼 클릭
	그러면 익스프레스 체크 박스 체크 됨 
	만약 적용하기 버튼 클릭
	그러면 음식점 리스트 정렬 변경

시나리오: 음식점 필터 화면에서 정렬 방법 적용
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 랭킹 정렬 '거리순' 클릭
	그리고 결제 방법 '현금' 클릭
	그리고 적용하기 버튼 클릭
	그러면 음식점 리스트 정렬 변경

	
시나리오: 음식점 필터 화면에서 정렬 방법 적용
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 랭킹 정렬 '별점순' 클릭
	그리고 결제 방법 '요기서결제' 클릭
	그리고 적용하기 버튼 클릭
	그러면 음식점 리스트 정렬 변경

	
시나리오: 음식점 필터 화면에서 정렬 방법 적용
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 랭킹 정렬 '리뷰 많은순' 클릭
	그리고 결제 방법 '현장카드' 클릭
	그리고 적용하기 버튼 클릭
	그러면 음식점 리스트 정렬 변경

	
시나리오: 음식점 필터 화면에서 정렬 방법 적용
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 랭킹 정렬 '사장님 댓글순' 클릭
	그리고 결제 방법 '결제수단 전체' 클릭
	그리고 적용하기 버튼 클릭
	그러면 음식점 리스트 정렬 변경


시나리오: 음식점 필터 적용 초기화
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 랭킹 정렬 '사장님 댓글순' 클릭
	그리고 결제 방법 '결제수단 전체' 클릭
	그리고 적용하기 버튼 클릭
	먼저 음식점 필터 클릭
	만일 음식점 필터 노출
	그리고 초기화 버튼 클릭
	그러면 음식점 필터 초기화
	그러면 음식점 리스트 정렬 변경


시나리오: 음식점 오른쪽 방향 스크롤하여 Tab 변경
	먼저 음식점 전체 리스트 화면 진입
	그리고 음식점 Recycle List 오른쪽 스크롤
	그러면 기존 선택된 Tab 오른쪽에 위치한 Tab으로 변경

시나리오: 음식점 오른쪽 마지막 Tab에서 스크롤하여 변경되지 않음
	먼저 음식점 전체 리스트 화면 진입
	그리고 음식점 Recycle List 마지막 Tab까지 오른쪽 스크롤
	그러면 Tab 변경되지 않음

시나리오: 음식점 왼쪽 방향 스크롤하여 Tab 변경
	먼저 음식점 전체 리스트 화면 진입
	먼저 램덤한 Tab으로 변경
	그리고 음식점 Recycle List 왼족 스크롤
	그러면 기존 선택된 Tab 왼쪽에 위치한 Tab으로 변경

시나리오: 음식점 왼쪽 마지막 Tab에서 스크롤하여 변경되지 않음
	먼저 음식점 전체 리스트 화면 진입
	그리고 음식점 Recycle List 마지막 Tab까지 왼쪽 스크롤
	그러면 Tab 변경되지 않음

시나리오: 음식점 리스트 윗방향으로 스크를을 한다.
	먼저 음식점 전체 리스트 화면 진입
	그리고 음식점 Recyle List Item Height 만큼 위로 스크롤
	그러면 음심점 Recyle View List 변경

시나리오: 음식점 리스트 윗방향으로 스크롤 하면 Top 버튼이 생겨난다.
	먼저 음식점 전체 리스트 화면 진입
	그리고 음식점 Recyle List Item Height 만큼 위로 스크롤
	그러면 Top 버튼이 노출 된다.

